// BSLLS:FunctionShouldHaveReturn-off

// Наследник расширяет родителя (который реализует ИнтерфейсРодителя)
// И сам реализует только ИнтерфейсПотомка
// Должен унаследовать реализацию ИнтерфейсРодителя от родителя
&Расширяет("РодительДляСценария")
&Реализует("ИнтерфейсПотомка")

// Реализует только свой метод, родительский интерфейс наследуется от родителя
//
// Возвращаемое значение:
//  Произвольный - тестовое значение
//
Функция МетодПотомка() Экспорт
КонецФункции

Процедура ПриСозданииОбъекта()
КонецПроцедуры