// BSLLS:FunctionShouldHaveReturn-off

// Наследник расширяет родителя (который предоставляет МетодРодителика)
// И сам реализует ОБА интерфейса - ИнтерфейсДетейника и ИнтерфейсРодителика
// НО НЕ реализует метод от родительского интерфейса (МетодРодителика)
&Расширяет("РодительРеализующийТретийИнтерфейс")
&Реализует("ИнтерфейсДетейника")
&Реализует("ИнтерфейсРодителика")

// Реализует только свой метод, не реализует МетодРодителика (должен быть ошибка)
Функция МетодДетейника() Экспорт
КонецФункции

Процедура ПриСозданииОбъекта()
КонецПроцедуры