// BSLLS:FunctionShouldHaveReturn-off

// Наследник расширяет родителя (который предоставляет МетодРодителика)
// И сам реализует ОБА интерфейса - ИнтерфейсДетейника и ИнтерфейсРодителика
// НО НЕ реализует метод от своего интерфейса (МетодДетейника)
&Расширяет("РодительРеализующийТретийИнтерфейс")
&Реализует("ИнтерфейсДетейника")
&Реализует("ИнтерфейсРодителика")

// Не реализует МетодДетейника (должен быть ошибка)
// МетодРодителика наследуется от родителя

Процедура ПриСозданииОбъекта()
КонецПроцедуры