// BSLLS:FunctionShouldHaveReturn-off

// Наследник расширяет родителя (который предоставляет МетодРодителя)
// И сам реализует ОБА интерфейса - ИнтерфейсПотомка и ИнтерфейсРодителя
// НО НЕ реализует метод от родительского интерфейса (МетодРодителя)
&Расширяет("РодительРеализующийТретийИнтерфейс")
&Реализует("ИнтерфейсПотомка")
&Реализует("ИнтерфейсРодителя")

// Реализует только свой метод, не реализует МетодРодителя (должен быть ошибка)
Функция МетодПотомка() Экспорт
КонецФункции

Процедура ПриСозданииОбъекта()
КонецПроцедуры