// BSLLS:FunctionShouldHaveReturn-off

// Наследник расширяет родителя (который реализует УникальныйИнтерфейсРодителика)
// И сам реализует только УникальныйИнтерфейсДетейника
// Должен унаследовать реализацию УникальныйИнтерфейсРодителика от родителя
&Расширяет("РодительДляСценарияТретий")
&Реализует("УникальныйИнтерфейсДетейника")

// Реализует только свой метод, родительский интерфейс наследуется
Функция УникальныйМетодДетейника() Экспорт
КонецФункции

Процедура ПриСозданииОбъекта()
КонецПроцедуры