// BSLLS:FunctionShouldHaveReturn-off

&Родитель
Перем СсылкаНаРодителя;

Функция ТестоваяДобавленнаяФункция() Экспорт
	Возврат 2;
КонецФункции

&Переопределяет
Функция ТестоваяПереопределяемаяФункция() Экспорт
	Возврат СсылкаНаРодителя.ТестоваяПереопределяемаяФункция() +  2;
КонецФункции

&Переопределяет
Функция ТестоваяПереопределяемаяФункцияСПараметрами(Парам1, Парам2) Экспорт
	Возврат СсылкаНаРодителя.ТестоваяПереопределяемаяФункцияСПараметрами(Парам1, Парам2) + 1;
КонецФункции

&Расширяет("ТестовыйРодитель")
Процедура ПриСозданииОбъекта()
КонецПроцедуры
