// Строка
//
Перем ИмяИнтерфейса;

// Имя интерфейса, который реализует промаркированный класс.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяИнтерфейса() Экспорт
	Возврат ИмяИнтерфейса;
КонецФункции

// Аннотация для указания, что класс должен реализовать указанный интерфейс.
// Используется для проверки наличия методов интерфейса в классе через ВалидаторАннотаций.
//
// Интерфейс представляет собой класс с процедурами и функциями.
//
// Параметры:
//  Значение - Строка - Имя интерфейса
//
&Аннотация("Реализует")
Процедура ПриСозданииОбъекта(Значение)
	ИмяИнтерфейса = Значение;
КонецПроцедуры