// Строка
//
Перем ИмяИнтерфейса;

// Имя интерфейса, который наследует промаркированный интерфейс.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяИнтерфейса() Экспорт
	Возврат ИмяИнтерфейса;
КонецФункции

// Аннотация для указания, что интерфейс наследует другой интерфейс.
// Используется для создания иерархии интерфейсов.
//
// Интерфейс представляет собой модуль с процедурами и функциями.
//
// Параметры:
//  Значение - Строка - Имя наследуемого интерфейса
//
&Аннотация("Наследует")
Процедура ПриСозданииОбъекта(Значение)
	ИмяИнтерфейса = Значение;
КонецПроцедуры